
const groups = "11ТГ 12ТГ	11СХ 12СХ	11РМ 11ИС	12ИС 11П 11КЛ	22ТГ 23ИС	21ГД 22ГДк 22ИСк 21НА	21СХ 21ИС	21РМ 21КЛ	21П	31НА 31ГД	32ГД 33ГД	31СХ 31ИС 32ИС	31РМ	31П	31КЛ	41УМД	42ГД	43ГД	41ИС	42ИС	41ММР	11МЭВ	12УМД	11УМД	21МИС	21МЭВ	31УМД	31ТО	31МИС	31МЭВ	41МЭВ	41ТО	41ТОВ	11СМ	21СМ	31СМ	11ОФ	21З	22З	31З	32П	21ЭВМ	31ЭВМ	32ЭВМ	21СЛ	31СЛ	32СЛ	11БДв	11Св	22Кв	22Пв 23Пв	22ТГв	21Пв	21Кв	31Св	24ГДв 34ГДв	31БДв 32БДв	31Пв 32Пв	33Пв 31Кв 32Кв	33Кв	32Св	41БДв	41Кв	41Пв";

const array = groups.split('	').join(' ').split(' ').sort()

const filterArray = array.filter((char)=>{
  return  char[0]==='4'
})

console.log(filterArray);